In [2]:
import pandas as pd
import numpy as np

### Question 1: 
Select all numeric columns except float from the DataFrame dft.

In [3]:
dft = pd.DataFrame(
    {
        "A": np.random.rand(3), 
        "B": 1, 
        "C": "foo", 
        "D": pd.Timestamp("20010102"), 
        "E": pd.Series([1.0] * 3).astype("float32"), # <-- pd.Series([1.0] * 3) the *3 is the length of the series
        "F": False, 
        "G": pd.Series([1] * 3, dtype="int8")})

dft

          A  B    C          D    E      F  G
0  0.756346  1  foo 2001-01-02  1.0  False  1
1  0.278282  1  foo 2001-01-02  1.0  False  1
2  0.259594  1  foo 2001-01-02  1.0  False  1

In [4]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

In [5]:
dft.select_dtypes(include='number',exclude='float')

   B  G
0  1  1
1  1  1
2  1  1

### Question 2: 
How do you return the last 3 rows of a DataFrame df?

In [6]:
df = pd.Series(np.arange(5), index=["a", "b", "c", "d", "e"])

df

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [7]:
df.iloc[-3:]

c    2
d    3
e    4
dtype: int64

### Question 3: 
Return the minimum and maximum of a Series x as a new Series with the index ["min", "max"]

In [8]:
x = pd.Series([10, 5, 8, 12, 3])

x

0    10
1     5
2     8
3    12
4     3
dtype: int64

In [9]:
new_x = pd.Series([x.min(),x.max()],index=["min","max"])

new_x

min     3
max    12
dtype: int64

### Question 4: 
Multiply df1 and df2 (two DataFrames) with a fill_value of 1.

In [10]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))

df2.loc[1, "b"] = np.nan

In [11]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [12]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [13]:
df1.multiply(df2)

      a     b      c      d   e
0   0.0   1.0    4.0    9.0 NaN
1  20.0   NaN   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [14]:
df1.multiply(df2,fill_value=1)

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0   5.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

### Question 5: 

How do you create a DataFrame from a nested dictionary of dictionaries?

nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

In [15]:
nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

pd.DataFrame(nested_dict)

   A  B
a  1  3
b  2  4